# LABRAB06  

**Л/Р 6 - 30,31.03.21**  
_deadline - 03.04.21 24:00_  

## task 0  
Шифр Цезаря  

Шифрование Цезаря — это вид шифра подстановки, в котором каждый символ в открытом тексте заменяется символом, находящимся на некотором постоянном числе позиций левее или правее него в алфавите.  
Если позиция символа в строке шифра выходит за правую границу, то нумерация продолжается циклически с самого левого края и наоборот - при переходе границы слева - продолжается справа.  
Написать программу с функцией шифрования/дешифрования по Цезарю.  
Сделать одну функцию и для шифрования и для дешифрования.  
Ниже приведён прототип с Лекции - можно его использовать за основу...  

```py
def code(alph, line, key):
    result = ''
    # написать код самостоятельно
    return result


rus = 'абвгдеёжзийклмнопрстуфхцчшщъыьэюя'
nums = '1234567890'
smbs = ':; !&-+=()*/.,'
alph = rus + rus.upper() + nums + smbs

line = 'Привед Медвед...'

key = 3 # это шаг смещения - может быть + или -

line_code = code(alph, line, key)
print(line_code)
```

## task 1  

Написать программу шифрования текста в рисунок  
Прототип - 05_in.py  

Требования:  

1) шифруемый текст считывать их текстового файла  

2) перед запуском шифрования проверять - поместятся ли все символы шифруемого текста в рисунок  

3) записывать биты только в **ОДИН компонент** пикселя (можно выбрать любой)  

4) записывать биты только в младший разряд компонента цвета  

5) когда заканчивается шифруемый текст нужно в рисунок записать назначенный кодовый символ, обозночающий конец текста (например, символ с кодом 0 - это можете выбрать сами), он важен при обратной дешифрации - так программа поймёт, что был прочитан весь текст  

## task 2  

Написать программу дешифрации текста из рисунка  
Прототип - 05_out.py  

Требования:  

1) заранее не задано сколько именно символов считывать - когда программа детектирует кодовый символ окончания текста, тогда и заканчивает...  

2) читать биты только из одного компонента пикселя  

3) читать биты только из младшего разряда компонента цвета  

4) прочитанный текст вывести на экран  

---  

Всё, этого достаточно для одной ЛАБРАБ...
